In [ ]:
"""

7.23 (Pandas: DataFrames) Perform the following tasks with pandas DataFrames:
a) Create a DataFrame named temperatures from a dictionary of three temperature readings each for 'Maxine', 'James' and 
'Amanda'.
b) Recreate the DataFrame temperatures in Part (a) with custom indices using the index keyword argument and a list 
containing 'Morning', 'Afternoon' and 'Evening'.
c) Select from temperatures the column of temperature readings for 'Maxine'.
d) Select from temperatures the row of 'Morning' temperature readings.
e) Select from temperatures the rows for 'Morning' and 'Evening' temperature readings.
f) Select from temperatures the columns of temperature readings for 'Amanda' and 'Maxine'.
g) Select from temperatures the elements for 'Amanda' and 'Maxine' in the 'Morning' and 'Afternoon'.
h) Use the describe method to produce temperatures’ descriptive statistics.
i) Transpose temperatures.
j) Sort temperatures so that its column names are in alphabetical order.

"""

In [1]:
import pandas as pd

In [5]:
# a) Create a DataFrame named temperatures from a dictionary of three temperature readings each for 'Maxine', 'James' and 
# 'Amanda'.

dictionary = {
    'Maxine': [50, 51, 52],
    'James': [54, 55, 56],
    'Amanda': [49, 50, 51],
}

temperatures = pd.DataFrame(dictionary)
temperatures

   Maxine  James  Amanda
0      50     54      49
1      51     55      50
2      52     56      51

In [6]:
# b) Recreate the DataFrame temperatures in Part (a) with custom indices using the index keyword argument and a list 
# containing 'Morning', 'Afternoon' and 'Evening'.

dictionary = {
    'Maxine': [50, 51, 52],
    'James': [54, 55, 56],
    'Amanda': [49, 50, 51],
}

temperatures = pd.DataFrame(dictionary, index=['Morning', 'Afternoon', 'Evening'])
temperatures

           Maxine  James  Amanda
Morning        50     54      49
Afternoon      51     55      50
Evening        52     56      51

In [7]:
# c) Select from temperatures the column of temperature readings for 'Maxine'.
temperatures.Maxine

Morning      50
Afternoon    51
Evening      52
Name: Maxine, dtype: int64

In [23]:
# d) Select from temperatures the row of 'Morning' temperature readings.

temperatures.loc['Morning']

Maxine    50
James     54
Amanda    49
Name: Morning, dtype: int64

In [14]:
# e) Select from temperatures the rows for 'Morning' and 'Evening' temperature readings.

temperatures.loc[['Morning','Evening'], :]

         Maxine  James  Amanda
Morning      50     54      49
Evening      52     56      51

In [15]:
# f) Select from temperatures the columns of temperature readings for 'Amanda' and 'Maxine'.

temperatures.loc[:, ['Amanda','Maxine']]

           Amanda  Maxine
Morning        49      50
Afternoon      50      51
Evening        51      52

In [22]:
# g) Select from temperatures the elements for 'Amanda' and 'Maxine' in the 'Morning' and 'Afternoon'.
temperatures.loc[['Morning','Afternoon'], ['Amanda','Maxine']]

           Amanda  Maxine
Morning        49      50
Afternoon      50      51

In [17]:
# h) Use the describe method to produce temperatures’ descriptive statistics.

temperatures.describe()

       Maxine  James  Amanda
count     3.0    3.0     3.0
mean     51.0   55.0    50.0
std       1.0    1.0     1.0
min      50.0   54.0    49.0
25%      50.5   54.5    49.5
50%      51.0   55.0    50.0
75%      51.5   55.5    50.5
max      52.0   56.0    51.0

In [18]:
# i) Transpose temperatures.

temperatures.T

        Morning  Afternoon  Evening
Maxine       50         51       52
James        54         55       56
Amanda       49         50       51

In [21]:
# j) Sort temperatures so that its column names are in alphabetical order.

temperatures.sort_index(axis=1)

           Amanda  James  Maxine
Morning        49     54      50
Afternoon      50     55      51
Evening        51     56      52